n, k = int(input()), int(input())
s = []
i = 1
while len(s) < n:
    if all([int(u) % k == 0 for u in str(i)]):
        s.append(i)
    i += 1
print(i - 1)
'''import re

words = {}
wordSplit = re.compile(r"[А-Яа-я]+")
stop = {"у": 1, "на": 1, "бы": 1, "и": 1, "а": 1, "с": 1, "да": 1, "там": 1, "тут": 1, "тот": 1, "ее": 1, "мы": 1,
        "из": 1, "от": 1, "не": 1, "вот": 1, "она": 1, "они": 1, "он": 1, "ты": 1, "вы": 1, "я": 1, "ну": 1, "здесь": 1,
        "в": 1, "что": 1, "как": 1, "к": 1, "но": 1, "за": 1, "по": 1, "это": 1, "эта": 1, "то": 1, "еще": 1, "них": 1,
        "для": 1, "их": 1, "кто": 1, "так": 1, "до": 1, "во": 1, "тоже": 1, "чтобы": 1, "через": 1, "о": 1, "же": 1,
        "ни": 1, "нас": 1, "под": 1, "вам": 1, "нам": 1, "мой": 1, "меня": 1, "толька": 1, "мне": 1, "пока": 1,
        "некогда": 1, "несколько": 1, "никак": 1, "д": 1, "т": 1, "минимально": 1, "максимально": 1, "абсолютно": 1,
        "огромный": 1, "предельно": 1, "только": 1, "извините": 1, "вероятно": 1, "со": 1, "дабы": 1, "затем": 1,
        "потом": 1, "лишь": 1, "слабо": 1, "самый": 1, "что-то": 1, "какой-то": 1, "где-то": 1, "как-то": 1,
        "дальше": 1, "ближе": 1, "раньше": 1, "позже": 1, "когда-то": 1, "нет": 1, "даже": 1, "если": 1, "такой": 1,
        "такая": 1, "такие": 1, "нее": 1, "или": 1, "потому": 1, "неё": 1, "ней": 1, "про": 1, "все": 1, "его": 1,
        "была": 1, "было": 1, "был": 1, "были": 1, "себя": 1, "итого": 1, "б": 1, "всего": 1, "ой": 1, "ого": 1,
        "эх": 1, "браво": 1, "без": 1, "над": 1, "здравствуйте": 1, "спасибо": 1, "при": 1, "после": 1, "вон": 1,
        "одной": 1, "один": 1, "где": 1, "всех": 1}
{"30": {"nums": [1, 5], "color":[1, 2, 3]}}
with open(input(), 'r', encoding='utf-8') as file:
    strings = file.readlines()
    text = " ".join(strings)
    text = re.sub(r'([^\s])-\n\s{1}', '\g<1>', text)
    for word in re.findall(wordSplit, text):
        word = word.lower()
        if not word in stop:
            if word in words:
                words[word] = words[word] + 1
            else:
                words[word] = 1
sortedDict = [k for k, v in sorted(words.items(), key=lambda item: item[1], reverse=True)]
print(" ".join(sortedDict[:50]))
'''